import Container from 'react-bootstrap/Container';
import Row from 'react-bootstrap/Row';
import Col from 'react-bootstrap/Col';
import styles from './AboutUs.module.scss';

import NavBar from '../../../components/layout/Navbar';
import UserInfo from '../../../components/UserInfo';

export default function AboutUs() {
  return (
    <div className={styles.AboutUs}>
      <Container>
        <Row>
          <Col xl={3} className="d-none d-xl-block">
            <div className={styles.userInfo}>
              <UserInfo />
            </div>
            <div className="d-none d-xl-block">
              <NavBar />
            </div>
          </Col>
          <Col xs={12} className="d-xl-none">
            <h1 className={styles.mainTitle}>О нас</h1>
          </Col>
          <Col xs={12} xl={9}>
            <p className={styles.mainDescription}>
              <span>S-G-U-Matrix</span> - это первая мультиматричная платформа с
              вариативной системой маркетинга.
            </p>
            <Row>
              <Col xs={12} xl={3}>
                <svg
                  className={styles.rocket}
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                  viewBox="0 0 214 200"
                >
                  <path
                    d="M47.2 96.44c-5.74.33-15.05 2.09-21.86 9.74l7.72 1.57s-9.37 4.98-14.86 11.67c8.28 2.6 18.83 1.6 18.83 1.6l-5.6 5.54c9.9 2.67 18.64-.97 23.62-3.85l13.77-16.28-21.62-9.99z"
                    fill="#8083E6"
                  />
                  <path
                    d="M129.13 68.64c37.3-6.9 58.3 2.06 65.15 5.88.73.4 1.28 1.06 1.53 1.82s.17 1.57-.21 2.24c-3.55 6.34-16.06 23.35-52.12 34.09 0 0-21.37 6.41-45.56 1.7l-4.4-13.44-4.38-13.44c17.84-14.8 39.98-18.85 39.98-18.85zM80.44 94.74l5.94 17.63 6.97-2.85-5.23-15.45-7.68.67z"
                    fill="#fff"
                  />
                  <path
                    d="M93.73 89.33l7 21.42-8.74 2.1-7-21.42 8.74-2.1z"
                    fill="#5430BF"
                  />
                  <path
                    d="M131.34 109.94l-13.28 17.8a10.24 10.24 0 01-3.27 2.81 11.3 11.3 0 01-4.26 1.32l-30.6 3.19a2.62 2.62 0 01-2.61-1.46 2.23 2.23 0 01-.21-.98c0-.43.15-.85.4-1.2.27-.34.63-.61 1.06-.76 5.6-2.02 26.11-10.16 28.69-22.76l24.08 2.04zM120.25 75.94L98.1 66.7c-1.44-.6-2.97-.92-4.5-.95a11.6 11.6 0 00-4.44.77l-28.07 10.9c-.32.13-.6.33-.83.57a2.1 2.1 0 00-.52 1.84c.06.33.2.65.41.93a2.6 2.6 0 002.44 1.03c6.02-.78 28.46-2.96 38.28 6.66l19.38-12.5z"
                    fill="#3F0A9A"
                  />
                  <path
                    d="M65.54 105.9l.92 2.86a1.39 1.39 0 001.12.92c.17.02.34.01.5-.03l52.87-11.59c.2-.04.4-.12.56-.24a1.42 1.42 0 00.6-1c.01-.19 0-.4-.07-.58l-1.44-4.4a1.58 1.58 0 00-.8-.92 1.75 1.75 0 00-1.23-.15l-52.19 13.66a1.2 1.2 0 00-.74.56c-.16.27-.2.6-.1.9z"
                    fill="#6663D7"
                  />
                  <path
                    d="M134.12 88.5c-.7-6.52 4.35-12.06 11.28-12.36 6.93-.31 13.12 4.73 13.82 11.26.7 6.52-4.35 12.06-11.28 12.37-6.93.3-13.12-4.74-13.82-11.26z"
                    fill="#3F0A9A"
                  />
                  <path
                    d="M144.2 80.41a7.7 7.7 0 00-3.93 2.3 7 7 0 00-1.78 4.03c-.15 1.5.18 3.03.95 4.4a8.56 8.56 0 003.38 3.28 8.91 8.91 0 004.67 1.07c1.6-.07 3.12-.6 4.37-1.5a7.13 7.13 0 002.57-8.02 8 8 0 00-1.52-2.7 8.7 8.7 0 00-5.54-3.01 8.61 8.61 0 00-3.18.15z"
                    fill="#7679EA"
                  />
                </svg>
              </Col>
              <Col xs={12} xl={9}>
                <p className={styles.text}>
                  Мультиматричная платформа STARS является доступным
                  инструментом для заработка в сети. Доступность нашей платформы
                  обеспечена уникальной особенностью – вариативной системой
                  маркетинга. Вариативная система маркетинга объединяет все
                  варианты партнерских и матричных программ. Благодаря такому
                  подходу каждый партнер STARS может выбрать для себя наиболее
                  выгодный матричный маркетинг и самостоятельно создать для себя
                  и своей команды комфортные условия работы, задать нужный темп
                  развития.
                </p>
              </Col>
            </Row>
            <Row className={styles.buildUpWrapper}>
              <Col
                xs={12}
                xl={3}
                className="d-xl-flex align-items-center order-xl-1"
              >
                <svg
                  className={styles.constructor}
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                  viewBox="0 0 163 107"
                >
                  <path
                    d="M163 26L41.14 59.65 0 34.58 121.86.93 163 26z"
                    fill="#AAADF0"
                  />
                  <path
                    d="M0 34.58l41.14 25.07v47.25L0 81.83V34.58z"
                    fill="#8083E6"
                  />
                  <path
                    d="M163 26L41.14 59.65v47.25L163 73.25V26zM92.98 3.22v11.5c0 1.78 6.38 3.22 14.23 3.22 7.86 0 14.25-1.44 14.25-3.22V3.22H92.98z"
                    fill="#4B0FB2"
                  />
                  <path
                    d="M107.21 6.44c7.86 0 14.23-1.44 14.23-3.22 0-1.78-6.37-3.22-14.23-3.22S92.98 1.44 92.98 3.22c0 1.78 6.37 3.22 14.23 3.22z"
                    fill="#8083E6"
                  />
                  <path
                    d="M112.3 15.5V27c0 1.77 6.36 3.21 14.22 3.21s14.23-1.44 14.23-3.22V15.5H112.3z"
                    fill="#4B0FB2"
                  />
                  <path
                    d="M140.75 15.5c0 1.77-6.37 3.21-14.23 3.21s-14.23-1.44-14.23-3.22c0-1.78 6.37-3.22 14.23-3.22s14.23 1.44 14.23 3.22z"
                    fill="#8083E6"
                  />
                  <path
                    d="M55.92 13.8v11.5c0 1.78 6.37 3.22 14.23 3.22s14.23-1.44 14.23-3.23V13.8H55.92z"
                    fill="#4B0FB2"
                  />
                  <path
                    d="M84.38 13.8c0 1.78-6.37 3.22-14.23 3.22-7.85 0-14.23-1.44-14.23-3.22 0-1.78 6.37-3.24 14.23-3.24s14.23 1.46 14.23 3.24z"
                    fill="#8083E6"
                  />
                  <path
                    d="M75.23 26.07v11.5c0 1.78 6.37 3.22 14.23 3.22s14.23-1.44 14.23-3.22v-11.5H75.23z"
                    fill="#4B0FB2"
                  />
                  <path
                    d="M103.7 26.07c0 1.78-6.38 3.22-14.24 3.22-7.85 0-14.23-1.44-14.23-3.22 0-1.77 6.37-3.22 14.23-3.22s14.23 1.44 14.23 3.22z"
                    fill="#8083E6"
                  />
                  <path
                    d="M18.16 23.93v11.5c0 1.78 6.38 3.22 14.23 3.22 7.86 0 14.24-1.44 14.24-3.22v-11.5H18.16z"
                    fill="#4B0FB2"
                  />
                  <path
                    d="M32.4 27.15c7.86 0 14.23-1.44 14.23-3.22 0-1.78-6.37-3.22-14.23-3.22s-14.23 1.44-14.23 3.22c0 1.78 6.37 3.22 14.23 3.22z"
                    fill="#8083E6"
                  />
                  <path
                    d="M37.47 36.2v11.5c0 1.78 6.38 3.22 14.24 3.22s14.23-1.44 14.23-3.21V36.2H37.47z"
                    fill="#4B0FB2"
                  />
                  <path
                    d="M65.93 36.2c0 1.78-6.37 3.22-14.22 3.22-7.86 0-14.23-1.44-14.23-3.21 0-1.78 6.36-3.22 14.23-3.22 7.86 0 14.22 1.44 14.22 3.22z"
                    fill="#8083E6"
                  />
                </svg>
              </Col>
              <Col xs={12} xl={9}>
                <p className={styles.text}>
                  Особенность мультиматричной платформы STARS{' '}
                  <span>функция BUILD-UP</span>, которая позволяет вручную
                  управлять структурой своей команды вплоть до расстановки
                  звеньев матрицы, чтобы она приносила максимальную прибыль.
                </p>
              </Col>
            </Row>
            <Row className={styles.educationWrapper}>
              <Col xs={12} xl={3} className="d-xl-flex align-items-center">
                <svg
                  className={styles.education}
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                  viewBox="0 0 103 104"
                >
                  <path
                    d="M0 54v-4.9l.1-.6.4-3.9c1.3-10.3 5.7-20 12.8-27.5A50.8 50.8 0 0169.8 3.4 51.4 51.4 0 01102.7 46l.3 3v5l-.1.5-.3 3.5a50.4 50.4 0 01-13.2 28.3 50.7 50.7 0 01-54.2 14.1 50.4 50.4 0 01-35-43.2L0 54zm51.4 39.7h2.9c10.3-.8 19-5 26.5-12 .2-.2.3-.5.3-.7v-3.5a7.2 7.2 0 00-2.6-5.6 18 18 0 00-3.8-2.6c-3-1.6-6.3-3-9.4-4.4a78 78 0 01-4.1-2 4 4 0 01-2-3.1l-.4-2.4a1.5 1.5 0 01.4-1.2c1.1-1.3 2-2.7 3-4.1l1.2-3c.2-.6.5-1 1.1-1.1a1.3 1.3 0 001-1c.6-1.9 1-3.8 1-5.7a1.1 1.1 0 00-.7-1.2A1 1 0 0165 39v-2.6c.2-1.5 0-3-.4-4.4a14.8 14.8 0 00-8.2-9 7.4 7.4 0 00-6.7 0c-1 .5-2 .8-3 .8a9 9 0 00-5 2 12.5 12.5 0 00-4.5 9.2v4.3a1.1 1.1 0 01-.4.8 1.4 1.4 0 00-.8 1.4 46.8 46.8 0 001.3 6.2c.2.2.5.3.8.3.6 0 .8.4 1 .9a15 15 0 003.2 6.2 4.5 4.5 0 011.1 4.5v.2c-.2 1.5-1 2.7-2.4 3.4l-10.3 4.7c-2.4 1-4.7 2.2-6.6 4a7.7 7.7 0 00-2.6 4.9l-.2 3a3.2 3.2 0 001.2 2.9 42 42 0 0028.7 11z"
                    fill="#4B0FB2"
                  />
                  <path
                    d="M51.3 87.2c-11 0-20.5-3.8-28.7-11.1a3.2 3.2 0 01-1.2-2.8l.1-3.1c.2-2 1.3-3.6 2.7-4.9 1.9-1.8 4.1-3 6.5-4l10.4-4.8c1.4-.6 2.1-1.8 2.4-3.3V53a4.5 4.5 0 00-1.2-4.5 15 15 0 01-3.2-6.2c-.1-.6-.4-.9-1-.9a1.3 1.3 0 01-1.2-1l-.7-3.4-.1-2a1.4 1.4 0 01.8-1.5 1.1 1.1 0 00.4-.8v-4.3c.3-3.6 1.5-6.8 4.4-9.2a9 9 0 015.1-2c1 0 2-.3 3-.8a7.4 7.4 0 016.6 0 15 15 0 018.3 9c.4 1.4.6 2.9.4 4.4v2.6a1 1 0 00.6 1.2 1.1 1.1 0 01.7 1.2c0 2-.3 3.8-.9 5.6a1.3 1.3 0 01-1 1c-.7.1-1 .5-1.2 1-.2 1.2-.7 2.2-1.2 3.2a45.7 45.7 0 01-3.3 4.7v.6c.1.8.1 1.6.3 2.3a4 4 0 002 3.1l4.1 2 9.5 4.5a18 18 0 013.8 2.6A7.2 7.2 0 0181 71v3.5c0 .2 0 .5-.2.6a41.6 41.6 0 01-26.6 12h-2.9z"
                    fill="#fff"
                  />
                  <path
                    d="M24.8 19.6l3.7-2 21-11.8a2.5 2.5 0 012.9 0l24.5 13.5.5.2-.7.4-4 1.7a.6.6 0 00-.4.6v9c0 .2.2.4.4.6a1.5 1.5 0 01.1 1.8 1.5 1.5 0 01-1.7.6 1.4 1.4 0 01-1-1.5l.7-1.1.2-.5v-8.4-.2l-.6.2-19 8.4c-.2.1-.5.1-.8 0L25.2 19.8l-.4-.2zM72.8 34.8l.3 6.1c-.8-.6-1.6-1-2.6-.5v-5.3l2.3-.3z"
                    fill="#fff"
                  />
                </svg>
              </Col>
              <Col xs={12} xl={9}>
                <p className={styles.text}>
                  Одним из основных продуктов нашей платформы является
                  уникальная система обучения STARS School. Участники обучающей
                  программы знакомятся с тонкостями сетевого бизнеса, а также
                  осваивают навыки командообразования, работы с трафиками и
                  методы работы в социальных сетях для привлечения потенциальных
                  партнеров.
                </p>
              </Col>
            </Row>
            <div className={styles.finalText}>
              <p className={styles.text}>
                Выстроенная система обучения, крепкое комьюнити и эффективный
                маркетинг – вот ключевые элементы мультиматричной платформы{' '}
                <span>S-G-U-Matrix</span>, которые гарантируют успех каждому!
              </p>
            </div>
          </Col>
        </Row>
      </Container>
    </div>
  );
}
